app/Http/Controllers/Owner/ShopController.php

    public function __construct()
    {
    $this->middleware('auth:owners');

    $this->middleware(function($request, $next) {
        // dd($request->route()->parameter('shop')); //文字列
        // dd(Auth::id()); //数字
        $id = $request->route()->parameter('shop'); //shopのid取得
        if(!is_null($id)){ // null判定
            $shopsOwnerId = Shop::findOrFail($id)->owner->id;
---
select * from `owners` where `owners`.`id` = 1 and `owners`.`deleted_at` is null limit 1
select * from `shops` where `shops`.`id` = '1' limit 1

    public function index()
    {
        // phpinfo();
        // $ownerId = Auth::id();
        $shops = Shop::where('owner_id', Auth::id())->get();
---
select * from `shops` where `owner_id` = 2

    public function edit($id)
    {
        $shop = Shop::findOrFail($id);
---
select * from `shops` where `shops`.`id` = '1' limit 1